app/workers/tree_fetcher.rb

INSERT INTO "tree_nodes" ("created_at", "updated_at", "external_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2019-10-15 08:01:21.488475"], ["updated_at", "2019-10-15 08:01:21.488475"], ["external_id", 1]]
---
  def perform
  	random_tree = JSON.parse(self.class.get('/').body)
  	root = TreeNode.create!(external_id: random_tree['id'])

INSERT INTO "tree_nodes" ("created_at", "updated_at", "ancestry", "external_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-10-15 08:07:32.452353"], ["updated_at", "2019-10-15 08:07:32.452353"], ["ancestry", "57"], ["external_id", 9710]]
---
  def create_children parent, children
  	children.each do |child|
  		tree_node = TreeNode.create!(external_id: child['id'], parent: parent)