app/controllers/trees_controller.rb

SELECT "tree_nodes".* FROM "tree_nodes" WHERE "tree_nodes"."external_id" = $1 LIMIT $2  [["external_id", 1], ["LIMIT", 1]]
---
	def show
		tree = TreeNode.find_by_external_id(params[:id])