app/models/tree_node.rb

	def ancestor_ids
		return [] if ancestry.nil?
		ancestry.split('/').map(&:to_i)
---
SELECT "tree_nodes".* FROM "tree_nodes" WHERE (("tree_nodes"."ancestry" LIKE '170/%' OR "tree_nodes"."ancestry" = '170') OR "tree_nodes"."id" = 170)